#include <stdio.h>
#include <math.h>
#include <locale.h>

void main()

{
	float x1, y1, r1, x2, y2, r2, d; // d-рассто€ние между центрами окружностей
	setlocale(LC_ALL, "Russian");

	printf("¬ведите координаты первой окружности и ее радиус: ");
	scanf("%f %f %f", &x1, &y1, &r1);
	printf("¬ведите координаты второй окружности и ее радиус: ");
	scanf("%f %f %f", &x2, &y2, &r2);

	d = sqrtf(((x1 - x2)*(x1 - x2)) + ((y1 - y2)*(y1 - y2)));

	if ((x1 == x2) && (y1 == y2) && (r1 == r2))
	{
		printf("ќкружности полностью совпадают.\n");
		return;
	}
	if ((x1 == x2) && (y1 == y2) && (r1 > r2))
	{
		printf("÷ентры окружностей совпадают, а втора€ окружность лежит в первой.\n");
		return;
	}
	if ((x1 == x2) && (y1 == y2) && (r1 < r2))
	{
		printf("÷ентры окружностей совпадают, а перва€ окружность лежит во второй.\n");
		return;
	}
	if (d >(r1 + r2))
	{
		printf("ќкружности не пересекаютс€ и не касаютс€, ни одна из окружностей не находитс€ в другой.\n");
		return;
	}
	if (d == (r1 + r2))
	{
		printf("ќкружности касаютс€ внешним образом.\n");
		return;
	}
	if ((d + r1) == r2)
	{
		printf("ќкружности касаютс€, причем перва§ окружность внешне касаетс€ со второй, т.е. перва€ внутри второй окружности.\n");
		return;
	}
	if ((d + r2) == r1)
	{
		printf("ќкружности касаютс€, причем втора€ окружность внешне касаетс€ с первой, т.е. втора€ внутри первой окружности.\n");
		return;
	}
	if ((d < (r1 + r2)) && (r1 < (d + r2)) && (r2 < (d + r1)))
	{
		printf("ќкружности пересекаютс€ и имеют две общие точки.\n");
		return;
	}
	if ((d < (r1 - r2)) || (d<(r2 - r1)))
	{
		printf("ќдна окружность находитс€ внутри другой, и они не пересекаютс€.\n");
		return;
	}
}